W5D2/RedditClone/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "DLKwiXBzCjDmO2RIAYK1AQ"], ["LIMIT", 1]]
---
  def current_user
    @current_user = User.find_by_session_token(session[:session_token])