W5D2/RedditClone/app/controllers/subs_controller.rb

  def edit
    @sub = current_user.subs.find(params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."user_id" = $1 AND "subs"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 1], ["LIMIT", 1]]

  def update
    @sub = current_user.subs.find(params[:id])
    if @sub.update_attributes(sub_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."user_id" = $1 AND "subs"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "Learn how to code quickly!"], ["updated_at", "2019-02-05 22:25:37.402859"], ["id", 1]]